plants-for-your-home-api/app/controllers/plants_controller.rb

SELECT "plants".* FROM "plants"
---
    def index
        render json: { status: 200, plants: Plant.all }

SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        plant = Plant.find(params[:id])

INSERT INTO "plants" ("stage", "kind", "image", "user_id", "shelf_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stage", "pot"], ["kind", "red"], ["image", "potred.png"], ["user_id", 2], ["shelf_id", 12]]
---
    def create
        @plant = Plant.new(plant_params)
        if @plant.save

SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "plants" SET "stage" = $1, "kind" = $2, "image" = $3 WHERE "plants"."id" = $4  [["stage", "seed"], ["kind", "brown"], ["image", "redbrown.png"], ["id", 2]]
---
    def update
        plant = Plant.find(params[:id])
        plant.update(plant_params)

DELETE FROM "plants" WHERE "plants"."id" = $1  [["id", 10]]
---
    def destroy
        destroy_plant = Plant.destroy(params[:id])