plants-for-your-home-api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        render json: { status: 200, users: User.all }

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = $1  [["user_id", 2]]
---
    def show
        user = User.find(params[:id])
        user_plants = Plant.where(user_id: user.id)

INSERT INTO "users" ("name") VALUES ($1) RETURNING "id"  [["name", "test"]]
---
    def create
        @user = User.new(user_params)
        if @user.save